Podkova/src/InformationRegisters/СостоянияОбменовССайтом/СостоянияОбменовССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОбменовССайтом</name>
  <resources>
    <name>РезультатВыполненияОбмена</name>
    <type>
      <types>EnumRef.РезультатыОбменаССайтом</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>НастройкаОбменаССайтом</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДействиеПриОбмене</name>
    <type>
      <types>EnumRef.ДействияПриОбменеССайтом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/УспешныеОбменыССайтом/УспешныеОбменыССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УспешныеОбменыССайтом</name>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>НастройкаОбменаССайтом</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДействиеПриОбмене</name>
    <type>
      <types>EnumRef.ДействияПриОбменеССайтом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ДействияПриОбменеССайтом/ДействияПриОбменеССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияПриОбменеССайтом</name>
  <enumValues>
    <name>ВыгрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/РезультатыОбменаССайтом/РезультатыОбменаССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыОбменаССайтом</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоСПредупреждениями</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/InformationRegisters/СостоянияОбменовССайтом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСостоянияОбменовССайтами() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменССайтом.Ссылка КАК Настройка
	|ИЗ
	|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
	|ГДЕ
	|	 НЕ ОбменССайтом.Ссылка = &ЭтотУзел";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтом.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		НаборЗаписейОбменДанными = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей();
		НаборЗаписейОбменДанными.Отбор.УзелИнформационнойБазы.Установить(Выборка.Настройка);
		НаборЗаписейОбменДанными.Прочитать();
		
		НаборЗаписейОбменССайтом = РегистрыСведений.СостоянияОбменовССайтом.СоздатьНаборЗаписей();
		НаборЗаписейОбменССайтом.Отбор.НастройкаОбменаССайтом.Установить(Выборка.Настройка);
		НаборЗаписейОбменССайтом.Прочитать();
		
		Для Каждого ЗаписьОбменаДанными Из НаборЗаписейОбменДанными Цикл
			
			ЗаписьОбменаССайтом = НаборЗаписейОбменССайтом.Добавить();
			 
			ЗаполнитьЗначенияСвойств(ЗаписьОбменаССайтом, ЗаписьОбменаДанными);
			
			ЗаписьОбменаССайтом.НастройкаОбменаССайтом = ЗаписьОбменаДанными.УзелИнформационнойБазы;
			
			Если ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ВыгрузкаДанных;
			ИначеЕсли ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ЗагрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ЗагрузкаДанных;
			КонецЕсли;
			ЗаписьОбменаССайтом.ДействиеПриОбмене = ДействиеПриОбмене;
			
			Если ЗаписьОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено Тогда
				Результат = Перечисления.РезультатыОбменаССайтом.Выполнено;
			ИначеЕсли ЗаписьОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями Тогда
				Результат = Перечисления.РезультатыОбменаССайтом.ВыполненоСПредупреждениями;
			ИначеЕсли ЗаписьОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка Тогда
				Результат = Перечисления.РезультатыОбменаССайтом.Ошибка;
			КонецЕсли;
			ЗаписьОбменаССайтом.РезультатВыполненияОбмена = Результат;
			
		КонецЦикла;
		
		НаборЗаписейОбменССайтом.Записать();
		
		НаборЗаписейОбменДанными.Очистить();
		НаборЗаписейОбменДанными.Записать();
		
		НаборЗаписейСостоянияУспешныхОбменов = РегистрыСведений.СостоянияУспешныхОбменовДанными.СоздатьНаборЗаписей();
		НаборЗаписейСостоянияУспешныхОбменов.Отбор.УзелИнформационнойБазы.Установить(Выборка.Настройка);
		НаборЗаписейСостоянияУспешныхОбменов.Прочитать();
		
		НаборЗаписейУспешныеОбменыССайтом = РегистрыСведений.УспешныеОбменыССайтом.СоздатьНаборЗаписей();
		НаборЗаписейУспешныеОбменыССайтом.Отбор.НастройкаОбменаССайтом.Установить(Выборка.Настройка);
		НаборЗаписейУспешныеОбменыССайтом.Прочитать();
		
		Для Каждого ЗаписьОбменаДанными Из НаборЗаписейСостоянияУспешныхОбменов Цикл
			
			ЗаписьОбменаССайтом = НаборЗаписейУспешныеОбменыССайтом.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьОбменаССайтом, ЗаписьОбменаДанными);
			
			ЗаписьОбменаССайтом.НастройкаОбменаССайтом = ЗаписьОбменаДанными.УзелИнформационнойБазы;
			
			Если ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ВыгрузкаДанных;
			ИначеЕсли ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ЗагрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ЗагрузкаДанных;
			КонецЕсли;
			ЗаписьОбменаССайтом.ДействиеПриОбмене = ДействиеПриОбмене;
			
		КонецЦикла;
		
		НаборЗаписейУспешныеОбменыССайтом.Записать();
		
		НаборЗаписейСостоянияУспешныхОбменов.Очистить();
		НаборЗаписейСостоянияУспешныхОбменов.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
